[
  {
    "title": "Rollups",
    "ingredients": [
      "4 skinless, boneless chicken breast halves",
      "1 (8 ounce) package cream cheese with chives",
      "2 tablespoons melted butter"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Pound meat to between 1/4 and 1/8 inch thick.\nSpread about a tablespoon of seasoned cream cheese on the bottom of each breast half. Roll up, and place in a casserole dish. Drizzle melted butter over rollups.\nBake in the preheated oven for about 30 minutes, or until chicken is cooked through and juices run clear.\nMelt extra cream cheese with chives in the microwave, and use as sauce for the chicken.\n",
    "embedding_ingredients": "skinless, boneless chicken breast halves, package cream cheese with chives, melted butter",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Quick Polynesian Chicken",
    "ingredients": ["6 chicken thighs", "1 (15.25 ounce) can fruit cocktail"],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nRinse and pat dry the chicken pieces. If you wish, remove the skins (not mandatory). Place chicken in a 9x13 inch baking dish.\nPour the fruit cocktail and juices evenly over the chicken and bake in the preheated oven for 1 hour (no turning or basting needed). Let cool and serve.\n",
    "embedding_ingredients": "hicken thighs, can fruit cocktail",
    "features": {
      "preparation_time": "medium",
      "prep_time": 60,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Buttermilk Oatmeal Bread",
    "ingredients": [
      "1 cup rolled oats",
      "1 cup buttermilk",
      "1/2 cup vegetable oil",
      "1 egg",
      "1/2 cup packed brown sugar",
      "1 cup all-purpose flour",
      "1 teaspoon baking powder",
      "1/2 teaspoon baking soda",
      "1/2 teaspoon salt"
    ],
    "instructions": "Mix oats with buttermilk. Let stand for 1/2 hour.\nStir oil, egg, and brown sugar into oat mixture. Stir together flour, baking powder, soda, and salt: mix into oat mixture. Pour batter into a greased and floured 8 1/2 x 4 1/2 inch loaf pan.\nBake at 350 degrees F (175 degrees C) for 55 to 60 minutes, or until done.\n",
    "embedding_ingredients": "rolled oats, buttermilk, vegetable oil, egg, packed brown sugar, all-purpose flour, baking powder, baking soda, alt",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "French Chocolate Cake",
    "ingredients": [
      "1/2 cup white sugar",
      "10 (1 ounce) squares semi-sweet chocolate",
      "3/4 cup unsalted butter, cubed",
      "2 teaspoons vanilla extract",
      "5 eggs, separated",
      "1/4 cup sifted all-purpose flour",
      "1 dash cream of tartar",
      "salt to taste",
      "confectioners' sugar, for dusting (optional)"
    ],
    "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Generously grease a 9-inch springform cake tin. Dust with a little sugar, and tap out the excess.\nSet aside 3 tablespoons of the sugar. Place the chocolate, butter, and remaining sugar in a large, heavy-based pan. Cook over moderate heat until the chocolate and butter have melted, and the sugar has dissolved. Remove the pan from heat. Stir in the vanilla, and leave the mixture to cool slightly.\nBeat the egg yolks into the chocolate mixture one at a time, beating well after each addition. Stir in the flour.\nIn a large bowl, scrupulously clean and grease-free, beat the egg whites until foamy. Add the cream of tartar and salt, and beat to stiff peaks. Sprinkle reserved sugar over egg whites, and beat until stiff and glossy. Use a whisk or spatula to fold 1/3 of the egg whites into the chocolate mixture, then carefully fold in the remaining whites. Carefully pour batter into the prepared tin, and tap the tin gently to release air bubbles.\nBake until well risen and a skewer inserted into the center of the cake comes out clean, for about 45 minutes to 1 hour. Check the cake after 30 minutes: if the cake appears to rise unevenly, rotate after 30 to 35 minutes. If the cake starts to crack or become too brown, place a piece of foil lightly over the top. Transfer the cake to a wire cooling rack, and remove the sides of the springform tin. Cool completely, and then remove the base. Do not attempt to remove the cake before it's completely cooled as this cake is very fragile.\n",
    "embedding_ingredients": "white sugar, squares semi-sweet chocolate, unsalted butter, cubed, vanilla extract, eggs, separated, ifted all-purpose flour, dash cream of tartar, salt to taste, confectioners' sugar, for dusting",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Mock Angel Food Cake",
    "ingredients": [
      "4 1/2 cups cake flour",
      "4 cups white sugar",
      "2 teaspoons salt",
      "2 cups boiling water",
      "16 egg whites",
      "2 tablespoons baking powder",
      "2 teaspoons cream of tartar",
      "2 teaspoons vanilla extract",
      "1 teaspoon almond extract"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSift cake flour, sugar, and salt three times then stir in the boiling water. Let cool.\nBeat egg whites, cream of tartar, baking powder, vanilla and almond flavorings until stiff peaks form. Fold into the flour mixture and pour batter into one ungreased 12x18 inch baking pan.\nBake at 350 degrees F (175 degrees C) for 35 minutes. Cool cake inverted in pan, laying a tea towel underneath the cake to absorb the steam. Frost as desired once the cake is cooled.\n",
    "embedding_ingredients": "cake flour, white sugar, salt, boiling water, egg whites, baking powder, cream of tartar, vanilla extract, almond extract",
    "features": {
      "preparation_time": "medium",
      "prep_time": 35,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Bourbon Whipped Cream",
    "ingredients": [
      "1 cup heavy whipping cream",
      "2 tablespoons white sugar",
      "1 1/2 tablespoons premium bourbon"
    ],
    "instructions": "In a medium bowl, whip cream until soft mounds form. Gradually add sugar, whipping until cream forms stiff peaks. Gently fold in bourbon. Chill until ready to serve.\n",
    "embedding_ingredients": "heavy whipping cream, white sugar, premium bourbon",
    "features": {
      "preparation_time": "short",
      "prep_time": 15,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Ginger Crinkles",
    "ingredients": [
      "2/3 cup vegetable oil",
      "1 cup white sugar",
      "1 egg",
      "1/4 cup molasses",
      "2 cups all-purpose flour",
      "2 teaspoons baking soda",
      "1 teaspoon ground cinnamon",
      "1 teaspoon ground ginger",
      "1/4 cup white sugar",
      "1/2 teaspoon salt"
    ],
    "instructions": "Mix oil and sugar thoroughly with electric mixer. Add egg and mix well. Pour in molasses. Sift and add dry ingredients until incorporated.\nRoll teaspoonful of dough into ball, drop into sugar to coat.\nPlace on ungreased cookie sheet. Bake at 350 degrees F (175 degrees C) for 15 minutes.\n",
    "embedding_ingredients": "vegetable oil, white sugar, egg, molasses, all-purpose flour, baking soda, cinnamon, ginger, white sugar, alt",
    "features": {
      "preparation_time": "medium",
      "prep_time": 15,
      "cuisine": "Asian",
      "complexity": "medium"
    }
  },
  {
    "title": "Lavender Cookies",
    "ingredients": [
      "5/8 cup butter",
      "1/2 cup white sugar",
      "1 egg",
      "1 tablespoon lavender flowers",
      "1 1/2 cups all-purpose flour",
      "1/2 cup colored sugar for decoration (optional)",
      "1 tablespoon lavender flowers"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nCream together the butter and sugar. Beat the egg, and blend into the butter and sugar. Mix in the lavender flowers and the flour. Drop batter by teaspoonfuls onto cookie sheets.\nBake 15 to 20 minutes, or until golden. Remove cookies to cooling racks, and sprinkle with decorative sugar and additional lavender flowers if desired.\n",
    "embedding_ingredients": "butter, white sugar, egg, lavender flowers, all-purpose flour, colored sugar for decoration, lavender flowers",
    "features": {
      "preparation_time": "medium",
      "prep_time": 20,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Scalloped Corn III",
    "ingredients": [
      "1 (15 ounce) can whole kernel corn, drained",
      "1 (15 ounce) can creamed corn",
      "2 eggs, beaten",
      "1 cup milk",
      "75 buttery round crackers, crushed fine",
      "1/2 cup chopped green onions"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly butter casserole dish and set aside.\nIn a large mixing bowl, combine the whole corn, creamed corn, eggs, milk, crackers and green onion; mix well.\nPour mixture into prepared casserole dish.\nBake at 350 degrees F (175 degrees C) for 50 minutes.\n",
    "embedding_ingredients": "can whole kernel corn, drained, can creamed corn, eggs, beaten, milk, buttery round crackers, fine, green onions",
    "features": {
      "preparation_time": "medium",
      "prep_time": 50,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Lemon Filling",
    "ingredients": [
      "3/4 cup white sugar",
      "2 tablespoons all-purpose flour",
      "2 tablespoons grated orange zest",
      "1/2 cup orange juice",
      "2 tablespoons fresh lemon juice",
      "1 egg",
      "1 cup whipped cream"
    ],
    "instructions": "In a saucepan over medium heat mix the white sugar, flour, orange juice, orange zest, lemon juice and the egg. Cook until thickened. Remove from heat and let cool completely before folding in the whipped cream. Makes enough to fill one 2 layer 9 inch round layer cake.\n",
    "embedding_ingredients": "white sugar, all-purpose flour, orange zest, orange juice, fresh lemon juice, egg, whipped cream",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Cranberry Oatmeal Cookies",
    "ingredients": [
      "10 tablespoons butter",
      "2/3 cup packed dark brown sugar",
      "1 teaspoon vanilla extract",
      "2 eggs",
      "1 1/2 teaspoons baking soda",
      "1 pinch salt",
      "1 2/3 cups whole wheat flour",
      "1 cup rolled oats",
      "2 cups chopped cranberries",
      "3/4 cup chopped walnuts"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBlend butter and sugar until fluffy. Add eggs and vanilla and mix well. In a separate bowl sift flour, baking soda, and salt together. Stir into butter mixture. Stir in the oats. Fold in nuts and cranberries. Drop spoonfuls of cookie dough onto ungreased cookie sheets, spaced at least 2 inches apart. These cookies spread.\nBake 8 to 10 minutes in the preheated oven, until the edges are crisp and the centers appear dry. Cool on wire racks and enjoy.\n",
    "embedding_ingredients": "butter, packed dark brown sugar, vanilla extract, eggs, baking soda, pinch salt, whole wheat flour, rolled oats, cranberries, walnuts",
    "features": {
      "preparation_time": "medium",
      "prep_time": 10,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Stuffed Mushrooms Casino",
    "ingredients": [
      "24 large fresh mushrooms",
      "1/2 cup butter",
      "1 tablespoon all-purpose flour",
      "1/3 cup chopped green onions",
      "1/3 cup sherry",
      "1 (16 ounce) can minced clams, drained with juice reserved",
      "3 cloves garlic, peeled and minced",
      "1/2 cup seasoned bread crumbs",
      "ground black pepper to taste",
      "1 teaspoon Italian-style seasoning",
      "1/2 cup bacon bits",
      "1/3 cup grated Romano cheese",
      "1/2 cup butter, melted",
      "1 lemon - cut into wedges, for garnish"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking sheet.\nRemove stems from mushrooms. Reserve and chop approximately 1/2. Arrange mushroom caps in a single layer on the prepared baking sheet so that the edges of the caps touch one another. Set aside.\nIn a small saucepan over medium heat, melt 1/2 cup butter. Place reserved, chopped mushroom stems in the pan, and slowly cook and stir until soft. Stir in the flour to coat mushroom stems. Mix in green onions, sherry, minced clams and 1/2 their reserved juice (discard remainder), garlic, bread crumbs, pepper, Italian-style seasoning and bacon bits. Continue cooking approximately 3 minutes, until all ingredients are well mixed. Remove from heat and stir in Romano cheese. Allow mixture to cool approximately 5 minutes.\nFill the mushroom caps generously with the mixture. Drizzle with melted butter.\nBake in the preheated oven 20 to 25 minutes, until lightly browned. Serve with lemon wedges.\n",
    "embedding_ingredients": "large fresh mushrooms, butter, all-purpose flour, green onions, herry, can clams, drained with juice reserved, loves garlic, and, easoned bread crumbs, black pepper to taste, italian-style seasoning, bacon bits, romano cheese, butter, melted, lemon - cut into wedges, for garnish",
    "features": {
      "preparation_time": "medium",
      "prep_time": 33,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Garlic Pickled Eggs",
    "ingredients": [
      "12 eggs",
      "1 onion, sliced into rings",
      "1 cup distilled white vinegar",
      "1 cup water",
      "1/4 cup white sugar",
      "10 cloves garlic, peeled"
    ],
    "instructions": "Place eggs in a medium saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool and peel.\nPlace the eggs in a 1 quart jar with the onion rings.\nIn a medium saucepan, bring to a boil the vinegar, water, sugar and garlic. Remove from heat and allow to cool approximately 15 minutes.\nPour the vinegar mixture over the eggs and cover. Refrigerate 1 week before serving.\n",
    "embedding_ingredients": "eggs, onion, into rings, distilled white vinegar, water, white sugar, loves garlic,",
    "features": {
      "preparation_time": "medium",
      "prep_time": 27,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Spicy Vegetable Beef Soup",
    "ingredients": [
      "1 pound rump roast",
      "2 tablespoons vegetable oil",
      "1 onion, chopped",
      "2 cloves garlic, minced",
      "1 (14 ounce) can beef broth",
      "1 (14 ounce) can stewed tomatoes",
      "1 quart water",
      "1 (16 ounce) package frozen mixed vegetables, thawed",
      "4 mushrooms, sliced",
      "2 stalks celery, chopped",
      "1/2 teaspoon dried oregano",
      "1/2 teaspoon dried thyme",
      "1/2 teaspoon dried basil",
      "1/2 teaspoon dried parsley",
      "1/4 teaspoon ground cayenne pepper",
      "6 ounces rotelle pasta"
    ],
    "instructions": "Trim fat from roast and cut into 1 inch cubes. Place meat in a large pot over medium heat with oil, onion and garlic and cook, stirring, until meat is browned and onion is tender. Pour in broth, tomatoes and water. Stir in mixed vegetables, mushrooms and celery. Season with oregano, thyme, basil, parsley and cayenne. Bring to a boil, then reduce heat, cover and simmer 75 minutes.\nStir in pasta and cook 10 minutes more, until pasta is tender.\n",
    "embedding_ingredients": "rump roast, vegetable oil, onion,, loves garlic,, can beef broth, can stewed tomatoes, quart water, package frozen mixed vegetables, thawed, mushrooms,, stalks celery,, dried oregano, dried thyme, dried basil, dried parsley, cayenne pepper, rotelle pasta",
    "features": {
      "preparation_time": "long",
      "prep_time": 85,
      "cuisine": "Italian",
      "complexity": "high"
    }
  },
  {
    "title": "Old-Fashioned Vegetable Soup",
    "ingredients": [
      "3 tablespoons butter",
      "1 onion, diced",
      "2 large carrots, diced",
      "3 stalks celery, diced",
      "1 (28 ounce) can whole peeled tomatoes, chopped, juice reserved",
      "1 teaspoon salt",
      "1/2 teaspoon ground black pepper",
      "1 teaspoon dried parsley",
      "3 tablespoons soy sauce",
      "1 tablespoon Worcestershire sauce",
      "1 teaspoon paprika",
      "2 quarts beef broth"
    ],
    "instructions": "In a large pot over medium heat, melt butter. Cook onion, carrots and celery until onion is translucent. Stir in tomatoes with their juice, salt, pepper, parsley, soy sauce, Worcestershire and paprika. Pour in beef broth. Bring to a boil, then reduce heat and simmer 30 minutes, until vegetables are tender and flavors are well blended.\n",
    "embedding_ingredients": "butter, onion,, large carrots,, stalks celery,, can whole tomatoes, , juice reserved, alt, black pepper, dried parsley, soy sauce, worcestershire sauce, paprika, quarts beef broth",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "Asian",
      "complexity": "high"
    }
  },
  {
    "title": "Gourmet Cheese Potatoes",
    "ingredients": [
      "10 pounds potatoes, quartered",
      "1/2 onion, grated",
      "2 (10.75 ounce) cans condensed Cheddar cheese soup",
      "1 1/2 cups milk",
      "2 1/2 cups sour cream",
      "1 pound processed cheese, cubed",
      "2 tablespoons butter, diced",
      "1/2 cup shredded Cheddar cheese"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes. Drain, cool and chop.\nPlace potatoes and onions in a 9x13 inch casserole dish.\nIn a medium saucepan combine soup, milk, sour cream and processed cheese; heat until cheese is melted. Pour over potatoes. Dot with butter and covered with shredded cheese.\nBake in preheated oven for 1 hour.\n",
    "embedding_ingredients": "potatoes, quartered, onion,, cans condensed cheddar cheese soup, milk, sour cream, processed cheese, cubed, butter,, hredded cheddar cheese",
    "features": {
      "preparation_time": "long",
      "prep_time": 75,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Lemon Chiffon Pudding",
    "ingredients": [
      "3 1/2 tablespoons all-purpose flour",
      "2/3 cup sugar",
      "2 tablespoons butter, softened",
      "3 tablespoons lemon juice",
      "2 egg yolks, beaten",
      "2/3 cup milk",
      "2 egg whites"
    ],
    "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a large bowl, stir together the flour and sugar until well blended. Stir in butter until smooth. Gradually beat in the egg yolks, lemon juice and milk. In a clean glass or metal bowl, whip egg whites with an electric mixer until stiff but flexible peaks form. Fold egg whites into the lemon mixture. Transfer to a casserole dish.\nBake for 35 minutes in the preheated oven, or until set. Serve warm or chilled.\n",
    "embedding_ingredients": "all-purpose flour, ugar, butter, softened, lemon juice, egg yolks, beaten, milk, egg whites",
    "features": {
      "preparation_time": "medium",
      "prep_time": 35,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Chocolate Shell Sauce",
    "ingredients": [
      "3 tablespoons butter",
      "2/3 cup semisweet chocolate chips"
    ],
    "instructions": "Melt butter and chocolate in a small saucepan over medium heat, or in the microwave. Stirring frequently. Serve over ice cream.\n",
    "embedding_ingredients": "butter, emisweet chocolate chips",
    "features": {
      "preparation_time": "short",
      "prep_time": 15,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Thai Hot and Sour Soup",
    "ingredients": [
      "3 cups chicken stock",
      "1 tablespoon tom yum paste",
      "1/2 clove garlic, finely chopped",
      "3 stalks lemon grass, chopped",
      "2 kaffir lime leaves",
      "2 skinless, boneless chicken breast halves - shredded",
      "4 ounces fresh mushrooms, thinly sliced",
      "1 tablespoon fish sauce",
      "1 tablespoon lime juice",
      "1 teaspoon chopped green chile pepper",
      "1 bunch fresh coriander, chopped",
      "1 sprig fresh basil, chopped"
    ],
    "instructions": "In a large saucepan, bring the chicken stock to a boil. Stir in the tom yum paste and garlic, and cook for about 2 minutes. Stir in the lemon grass and kaffir lime leaves. Place the chicken in the saucepan, and cook 5 minutes, or until no longer pink and juices run clear.\nMix in the mushrooms. Add the fish sauce, lime juice, and green chile pepper. Continue cooking until well blended. Remove from heat, and serve warm with the coriander and basil.\n",
    "embedding_ingredients": "chicken stock, tom yum paste, love garlic, finely, stalks lemon grass,, kaffir lime leaves, skinless, boneless chicken breast halves - shredded, fresh mushrooms, thinly, fish sauce, lime juice, green chile pepper, bunch fresh coriander,, sprig fresh basil,",
    "features": {
      "preparation_time": "medium",
      "prep_time": 7,
      "cuisine": "Asian",
      "complexity": "high"
    }
  },
  {
    "title": "Lemon Thyme Chicken Tenders",
    "ingredients": [
      "2 tablespoons olive oil",
      "1 clove garlic, minced",
      "6 sprigs fresh thyme, leaves stripped and chopped",
      "1 tablespoon lemon zest",
      "1/4 cup lemon juice",
      "salt and pepper to taste",
      "1 pound chicken breast tenders",
      "olive oil-flavored cooking spray"
    ],
    "instructions": "Combine the olive oil, garlic, chopped thyme, lemon zest, and lemon juice in a large mixing bowl. Season the chicken tenders with salt and pepper. Toss chicken with the olive oil mixture; allow to marinate for 5 minutes.\nSpray a non-stick skillet with cooking spray, and place over medium-high heat. Cook chicken tenders in the hot pan until lightly browned and cooked through, about 4 minutes per side.\n",
    "embedding_ingredients": "olive oil, love garlic,, sprigs fresh thyme, leaves stripped and, lemon zest, lemon juice, salt and pepper to taste, chicken breast tenders, olive oil-flavored cooking spray",
    "features": {
      "preparation_time": "medium",
      "prep_time": 9,
      "cuisine": "Mediterranean",
      "complexity": "medium"
    }
  },
  {
    "title": "S'More Bars II",
    "ingredients": [
      "1 1/2 cups butter, melted",
      "4 cups graham cracker crumbs",
      "6 (1.5 ounce) bars milk chocolate candy bars",
      "2 cups miniature marshmallows"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan.\nIn a medium bowl, mix together the melted butter and graham cracker crumbs. Press half of the graham cracker mixture into the bottom of the prepared pan. In the microwave or in a metal bowl over a pan of simmering water, melt chocolate chips, stirring frequently until smooth. Remove from heat and spread over the graham cracker layer. For easier spreading, refrigerate the crust while the chocolate is melting. Make a layer of marshmallows over the chocolate and top with the remaining graham cracker crumbs.\nBake for 15 minutes in the preheated oven, cool and cut into squares.\n",
    "embedding_ingredients": "butter, melted, graham cracker crumbs, bars milk chocolate candy bars, miniature marshmallows",
    "features": {
      "preparation_time": "medium",
      "prep_time": 15,
      "cuisine": "American",
      "complexity": "low"
    }
  },
  {
    "title": "Carne Con Chilies",
    "ingredients": [
      "4 large boneless pork chops, fat trimmed and reserved",
      "1/4 teaspoon ground black pepper, or to taste",
      "1/2 teaspoon garlic powder, or to taste",
      "1/2 teaspoon seasoning salt, or to taste",
      "1 lime, cut into 4 wedges",
      "10 tomatillos, husked and cut in half",
      "1 tomato, quartered",
      "2 jalapeno peppers, seeded and halved",
      "3 dried red chile peppers, chopped",
      "1 clove garlic",
      "1/2 teaspoon salt, or to taste"
    ],
    "instructions": "Slice pork chops into strips, and season with pepper, garlic powder and seasoning salt. Squeeze lime juice over pieces.\nHeat a skillet over medium heat. Add fat, and cook, stirring until pan is coated. Remove fat, and put the seasoned meat in the pan. Fry until browned, about 5 minutes.\nAt the same time, make the green sauce. Combine the tomatillos, tomato, jalapenos, and dried chilies in a saucepan. Bring to a boil, and cook until soft. Drain excess liquid, and transfer to a blender or food processor along with the garlic and salt. Blend until smooth.\nPour sauce over the meat in the pan, and simmer for 15 minutes to blend all of the flavors. Taste, and adjust salt and pepper if necessary.\n",
    "embedding_ingredients": "large boneless pork chops, fat trimmed and reserved, black pepper, or to taste, garlic powder, or to taste, easoning salt, or to taste, lime, cut into wedges, tomatillos, husked and cut in half, tomato, quartered, jalapeno peppers, seeded and halved, dried red chile peppers,, love garlic, alt, or to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 20,
      "cuisine": "American",
      "complexity": "high"
    }
  },
  {
    "title": "Easter Basket Cake",
    "ingredients": [
      "1 (18.25 ounce) package white cake mix",
      "1 (16 ounce) can white frosting",
      "2 drops green food coloring",
      "1/2 teaspoon water",
      "2 cups flaked coconut",
      "1 (14 ounce) package candy-coated chocolate pieces"
    ],
    "instructions": "Prepare the cake mix and bake the cake in two 8 inch rounds according to package directions. Cool completely.\nCut a circle out of the center of one of the layers, leaving a ring that measures 1 1/2 inches from the outer to the inner edge. Place the uncut layer on a serving platter and frost the top. Place the ring layer on top of the frosted layer, and frost the sides and top of the basket. Decorate the sides and top by pressing candy pieces into the frosting.\nTo tint the coconut, combine water and green food coloring in a medium bowl. Stir in coconut with a fork until evenly tinted. Place green coconut grass in center of cake basket.\nTo make a handle, cut a piece of aluminum foil 8x16 inches. Fold in half lengthwise 4 times. Wrap with ribbon, securing the ends with tape. Insert ends of the handle into the cake top. Fill basket with Easter candy and goodies, if desired.\n",
    "embedding_ingredients": "package white cake mix, can white frosting, drops green food coloring, water, flaked coconut, package candy-coated chocolate pieces",
    "features": {
      "preparation_time": "medium",
      "prep_time": 30,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Quick Shrimp Scampi Pasta",
    "ingredients": [
      "8 ounces uncooked spaghetti",
      "1/2 cup butter",
      "2 cups dry white wine",
      "2 pounds large shrimp, peeled and deveined",
      "1 teaspoon dried basil"
    ],
    "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a large saucepan, melt butter and add white wine. Over medium heat, add shrimp and basil. Cook until pink all over; about 3 to 5 minutes. Serve over pasta.\n",
    "embedding_ingredients": "uncooked spaghetti, butter, dry white wine, large shrimp, and deveined, dried basil",
    "features": {
      "preparation_time": "medium",
      "prep_time": 15,
      "cuisine": "Italian",
      "complexity": "low"
    }
  },
  {
    "title": "Almond Buttercrunch Candy I",
    "ingredients": [
      "2 (11.5 ounce) packages milk chocolate chips, divided",
      "2 cups butter",
      "1 pound brown sugar",
      "1 cup blanched slivered almonds, divided"
    ],
    "instructions": "Preheat oven to 200 degrees F (95 degrees C). Grease a 14 x 18 inch cookie sheet.\nSprinkle one package of chocolate chips on prepared pan. Place in warm oven until chips melt, about 5 minutes. Remove from oven, and spread melted chocolate over bottom of pan; set aside.\nIn a large heavy saucepan over medium-high heat, combine butter and brown sugar. Stirring constantly, heat to 300 to 310 degrees F (149 to 154 degrees C), or until a small amount of syrup dropped into cold water forms hard, brittle threads. Immediately remove from heat. Stir in 3/4 cup slivered almonds and pour onto pan with melted chocolate; spread mixture evenly.\nSprinkle remaining package of chocolate chips over the almond layer. The heat from the almond layer will melt the chocolate chips; spread melted chocolate evenly. Sprinkle remaining 1/4 cup almonds over chocolate.\nCut into squares, or allow to harden in a solid sheet and break it apart like brittle. Cool completely before removing from pan.\n",
    "embedding_ingredients": "packages milk chocolate chips, divided, butter, brown sugar, blanched slivered almonds, divided",
    "features": {
      "preparation_time": "medium",
      "prep_time": 5,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "New York System Hot Wiener Sauce I",
    "ingredients": [
      "3 pounds ground beef",
      "2 teaspoons chili powder",
      "2 teaspoons dry mustard",
      "1/2 teaspoon ground allspice",
      "1/2 teaspoon ground nutmeg",
      "1/2 teaspoon onion salt",
      "1/2 teaspoon garlic salt",
      "1/2 teaspoon celery salt",
      "1/4 teaspoon minced fresh ginger root",
      "1 teaspoon ground cumin",
      "1/2 teaspoon Worcestershire sauce",
      "1 teaspoon soy sauce",
      "10 ounces ketchup"
    ],
    "instructions": "Place ground beef in a large, deep skillet. Cook over medium high heat until evenly brown; drain.\nMix the chili powder, dry mustard, allspice, nutmeg, onion salt, garlic salt, celery salt, ginger root, cumin, Worcestershire sauce, soy sauce and ketchup into the skillet. Simmer at least 1 hour, until a desirable consistency has been attained. Serve hot.\n",
    "embedding_ingredients": "beef, chili powder, dry mustard, allspice, nutmeg, onion salt, garlic salt, celery salt, fresh ginger root, cumin, worcestershire sauce, oy sauce, ketchup",
    "features": {
      "preparation_time": "medium",
      "prep_time": 60,
      "cuisine": "Asian",
      "complexity": "high"
    }
  },
  {
    "title": "Quick and Easy Chicken and Tomato Pasta",
    "ingredients": [
      "1/2 (16 ounce) package angel hair pasta",
      "olive oil",
      "2 skinless, boneless chicken breast halves - chopped",
      "2 teaspoons garlic and herb seasoning blend",
      "1 (6 ounce) can sliced black olives, drained",
      "1 (8 ounce) can sliced mushrooms, drained",
      "2 (16 ounce) cans diced tomatoes",
      "freshly grated Parmesan cheese"
    ],
    "instructions": "Bring a large pot of lightly salted water to a boil. Boil pasta for 8 to 10 minutes, or until al dente. Drain.\nHeat olive oil in a large skillet over medium high heat. Sprinkle chicken with seasoned salt, and cook for 2 to 3 minutes. Stir in drained black olives and mushrooms. Continue cooking, stirring occasionally, until chicken is golden brown. Strain chicken juices from pan, and reduce heat to low. Stir in tomatoes, cover, and simmer for 15 minutes.\nToss the pasta and chicken mixture together, sprinkle with Parmesan cheese, and serve.\n",
    "embedding_ingredients": "package angel hair pasta, olive oil, skinless, boneless chicken breast halves -, garlic and herb seasoning blend, can black olives, drained, can mushrooms, drained, cans tomatoes, freshly parmesan cheese",
    "features": {
      "preparation_time": "medium",
      "prep_time": 28,
      "cuisine": "Italian",
      "complexity": "medium"
    }
  },
  {
    "title": "Apple Radish BBQ Ribs",
    "ingredients": [
      "4 pounds pork spareribs",
      "2 quarts apple juice",
      "3 cups barbecue sauce",
      "1/2 cup prepared horseradish",
      "3 tablespoons Worcestershire sauce",
      "1 teaspoon garlic salt"
    ],
    "instructions": "Place ribs in a stock pot, and cover with apple juice. Bring to a boil, reduce heat, and simmer for 1 to 2 hours. Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, mix together barbecue sauce, horseradish, Worcestershire sauce, and garlic salt. Stir in 3 tablespoons of the apple juice from the ribs.\nBrush underside of ribs with 1/3 of the sauce. Turn them over, and place in roasting pan. Brush tops with remaining sauce.\nBake in preheated oven for 25 to 35 minutes, brushing occasionally with sauce.\n",
    "embedding_ingredients": "pork spareribs, quarts apple juice, barbecue sauce, prepared horseradish, worcestershire sauce, garlic salt",
    "features": {
      "preparation_time": "long",
      "prep_time": 120,
      "cuisine": "American",
      "complexity": "medium"
    }
  },
  {
    "title": "Squash with Tomato and Feta Cheese",
    "ingredients": [
      "2 cups peeled and cubed acorn squash",
      "2 eggs",
      "1/3 cup heavy cream",
      "2 green onions, chopped",
      "1/4 green bell pepper, diced",
      "1 cup dry bread stuffing mix",
      "1/4 cup grated Parmesan cheese",
      "1 teaspoon salt",
      "1/2 teaspoon cracked black peppercorns",
      "1 sprig fresh rosemary",
      "2 tablespoons crumbled feta cheese",
      "2 roma (plum) tomatoes, thinly sliced",
      "cracked black pepper to taste"
    ],
    "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a medium casserole dish.\nIn a steamer basket over boiling water, steam the squash 10 minutes, or until tender. Remove from heat, and mash with a fork.\nIn a medium bowl, blend the eggs and heavy cream. Mix in the squash, 3/4 of the green onions, green bell pepper, dry stuffing mix, and Parmesan cheese. Season with salt and pepper. Transfer to the prepared casserole dish. Press the rosemary sprig into the center of the mixture. Top with feta cheese, tomato slices, and remaining green onions. Season with pepper.\nBake 45 minutes in the preheated oven, until lightly browned. Discard rosemary sprig before serving.\n",
    "embedding_ingredients": "and cubed acorn squash, eggs, heavy cream, reen onions,, reen bell pepper,, dry bread stuffing mix, parmesan cheese, alt, cracked black peppercorns, sprig fresh rosemary, crumbled feta cheese, roma tomatoes, thinly, cracked black pepper to taste",
    "features": {
      "preparation_time": "medium",
      "prep_time": 55,
      "cuisine": "Italian",
      "complexity": "high"
    }
  }
]
